Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/СрокОбновленияСИЗ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИдентификаторСтроки") Тогда
		ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
	КонецЕсли;
	
	Если Параметры.Свойство("Кратность") Тогда
		Кратность = Параметры.Кратность;
	КонецЕсли;
	
	Если Параметры.Свойство("ЕдиницаПериодичности") Тогда
		ЕдиницаПериодичности = Параметры.ЕдиницаПериодичности;
	КонецЕсли;
	
	Если Параметры.Свойство("Периодичность") Тогда
		Периодичность = Параметры.Периодичность;
	КонецЕсли;
	
	Если Параметры.Свойство("СпособВыдачи") Тогда
		СпособВыдачи = Параметры.СпособВыдачи;
	КонецЕсли;
	
	Если Параметры.Свойство("Дежурное") Тогда
		Дежурное = Параметры.Дежурное;
	КонецЕсли;
	
	Если Параметры.Свойство("ПериодичностьТолькоПросмотр") И Параметры.ПериодичностьТолькоПросмотр = Истина Тогда
		ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособВыдачи", "Видимость", Ложь);
	КонецЕсли;
	
	ПриИзмененииСпособаВыдачиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.СПериодичностью Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив; //Массив Из Строка
	УдаляемыеРеквизиты.Добавить("Кратность");
	УдаляемыеРеквизиты.Добавить("Периодичность");
	УдаляемыеРеквизиты.Добавить("ЕдиницаПериодичности");
	
	Для каждого ИмяРеквизита Из УдаляемыеРеквизиты Цикл
		УдаляемыйРеквизит = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
		Если УдаляемыйРеквизит <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйРеквизит);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КратностьВыдачиПриИзменении(Элемент)
	ОбновитьПредставлениеПериодичности();
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	ОбновитьПредставлениеПериодичности();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПериодичностиПриИзменении(Элемент)
	ОбновитьПредставлениеПериодичности();
КонецПроцедуры

&НаКлиенте
Процедура СпособВыдачиПриИзменении(Элемент)
	ПриИзмененииСпособаВыдачиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДежурноеПриИзменении(Элемент)
	ОбновитьПредставлениеПериодичности();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Периодичность", Периодичность);
	ПараметрЗакрытия.Вставить("Кратность", Кратность);
	ПараметрЗакрытия.Вставить("ЕдиницаПериодичности", ЕдиницаПериодичности);
	ПараметрЗакрытия.Вставить("ПредставлениеПериодичности", ПредставлениеПериодичности);
	ПараметрЗакрытия.Вставить("СпособВыдачи", СпособВыдачи);
	ПараметрЗакрытия.Вставить("Дежурное", Дежурное);
	ПараметрЗакрытия.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПредставлениеПериодичности()
	
	ПредставлениеПериодичности = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
		Кратность, Периодичность, ЕдиницаПериодичности, , , СпособВыдачи);
	
	Если Дежурное Тогда
		ПредставлениеПериодичности = ПредставлениеПериодичности + " - " + НСтр("ru='дежурное'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСпособаВыдачиНаСервере()
	
	СПериодичностью = СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.СПериодичностью;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаПериодичность", "Видимость", СПериодичностью);
	
	УстановитьОтметкуНезаполненногоЭлементов(Элементы, СПериодичностью);
	
	Если Не СПериодичностью Тогда
		Кратность = 1;
		Периодичность = 1;
		ЕдиницаПериодичности = Перечисления.Периодичность.Год;
	КонецЕсли;
	
	ОбновитьПредставлениеПериодичности();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтметкуНезаполненногоЭлементов(Элементы, ЗначениеОтметки)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КратностьВыдачи", "АвтоОтметкаНезаполненного", ЗначениеОтметки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Периодичность", "АвтоОтметкаНезаполненного", ЗначениеОтметки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЕдиницаПериодичности", "АвтоОтметкаНезаполненного", ЗначениеОтметки);

КонецПроцедуры

#КонецОбласти
